$(document).ready(function () {
    
    //pinakas me ratses skulwn
    var dogRaces = ["Ημίαιμο","Αγ.Βερνάρδου", "Αγγλικό Μπουλντόγκ", "Αγγλικό Σέτερ", "Αγγλικός Ποιμενικός", "Ακίτα", "Aριέγης", "Αρτουά", "Αφγανικό Λαγωνικό", "Βέλγικο Ποιμενικό", 
    "Βαϊμαράνερ ", "Βιζλα", "Γαλλικό Μπουλντόγκ", "Γερμανικός Ποιμενικός ", "Γιορκσάιρ Τεριέ ", "Γιούρα Μπρούνο", "Γκρέι Χάουντ", "Γκριφόν", "Γκόλντεν Ριτρίβερ", 
    "Γουέστ Χάιλαντ", "Γουίπετ", "Δαλματίας", "Ελληνικός Ιχνηλάτης", "Ελληνικός Ποιμενικός", "Έπανιέλ Μπρετόν", "Θιβετιανό Μαστίφ", "Κάνγκαλ", "Κάνε Κόρσο", "Κανίς",
    "Καναδέζικο Λυκόσκυλο", "Κινγκ Τσαρλς", "Κοκόνι", "Κουρτσχαάρ", "Κρητικός Λαγωνικός", "Κόκερ Σπάνιελ", "Κόλεϊ ", "Κόργκι", "Λάσα Άπσο", "Λαμπραντόρ Ριτρίβερ",
    "Λευκό Ελληνικό Τσοπανόσκυλο", "Μάλαμουτ", "Μαλινουά", "Μαλτέζ", "Μαστίνο Ναπολιτάνο", "Μεγάλος Δανός", "Μολοσσός της Ηπείρου", "Mπάλκαν", "Μπαντόγκ",
    "Μπασέ Χάουντ", "Μπηγκλ", "Μπισόν Φριζέ", "Μπλάντ Χάουντ", "Μπλέ γασκώνης", "Μπουλ Μαστίφ", "Μπουλ Ντογκ", "Μπουλ Τερριέ", "Μπόξερ", "Μπόρντερ Κόλεϋ",
    "Νέας Γής", "Ντατσχάουντ - Λουκάνικο", "Ντογκ ντε Μπορντώ", "Ντρατχάαρ", "Ντόγκο Αρτζεντίνο", "Ντόμπερμαν", "Ολλανδικό Ποιμενικό", "Ορεινός Πυρηναίων",
    "Ορεινός σκύλος Βέρνης", "Πίνσερ", "Πίτ Μπουλ Τερριέ", "Παγκ", "Παπιγιόν", "Πεκινουά", "Ποιμενικός Καυκάσου", "Ποιμενικός Κεντρ. Ασίας", "Πομεράνιαν",
    "Πρέσα Κανάριο", "Πόιντερ", "Ροτβάιλερ", "Σίμπα Ίνου", "Σαμογιέντ", "Σαρ Πέι", "Σεγκούτσι", "Σιβηρικό Χάσκυ", "Σιχ Τσου", "Σνάουτσερ", "Σπιτζ ",
    "Σπρίνγκερ Σπάνιελ", "Τεριέ", "Τεριέ Βοστόνης", "Τζακ Ράσελ Τεριέ", "Τσιουάουα", "Τσοου Τσόου ", "Φοξ Τερριέ"];

    //pinakas me ratses gatwn
    var catRaces = ["Ημίαιμο","Αβυσσυνίας", "Αγκύρας", "Αιγυπτιακή Μάου", "Αμερικανική Κοντότριχη", "Βεγγάλης", "Βιρμανίας",
    "Βρετανική Κοντότριχη", "Βρετανική Μακρύτριχη", "Γάτα Αιγαίου", "Γάτα Βομβάης", "Γάτα Νορβηγικού Δάσους",
    "Γάτα Σαβάννας", "Γάτα του Σιάμ", "Εξωτική", "Εξωτική Κοντότριχη", "Ιμαλαΐων", "Μέιν Κουν", "Μανξ", "Μπαλινέζα",
    "Οριεντάλ Κοντότριχη", "Περσική", "Ραγκ Ντόλ", "Ρωσική μπλέ γάτα", "Ρωσσική", "Σιαμαίζα", "Σιβηρίας", "Σιγκαπούρης",
    "Σφίγγα", "American Curl", "Kurilian Bobtail", "Munchkin", "Oriental", "Turkvan Cat"];



//poleis apo 2k katoikous kai panw
   var cities =["Άγιοι Θεόδωροι Κορινθίας", "Άγιος Αθανάσιος Δράμας", "Άγιος Αθανάσιος Θεσ/νίκης", "Άγιος Βασίλειος Αχαΐας", "Άγιος Κήρυκος Ικαρίας", 
   "Άγιος Κωνσταντίνος Φθιώτιδας", "Άγιος Νικόλαος", "Άγιος Νικόλαος Ληλαντίων", "Άγιος Στέφανος", "Άδενδρο", "Άμφισσα", "Άνοιξη", "Άργος", 
   "Άργος Ορεστικό", "Άρια Αργολίδας", "Άρτα", "Άρτεμη", "Άστρος", "Έδεσσα", "Ίασμος Ροδόπης", "Αίγινα", "Αίγιο", "Αγία Βαρβάρα Ηρακλείου", 
   "Αγία Μαρίνα Κορωπίου", "Αγία Μαρίνα Λέρου", "Αγία Μαρίνα Χανίων", "Αγία Παρασκευή Θεσ/νίκης", "Αγία Παρασκευή Λέσβου", "Αγία Τριάδα Θεσσαλονίκης", 
   "Αγιά Λάρισας", "Αγιάσος	", "Αγρίνιο", "Αγριά", "Αθήνα", "Αιάντειο Σαλαμίνας", "Αιανή Κοζάνης", "Αιγίνιο", "Αιτωλικό", "Αλίαρτος", "Αλεξάνδρεια", 
   "Αλεξανδρούπολη", "Αλεπού Κέρκυρας", "Αλιβέρι", "Αλιστράτη", "Αλμυρός", "Αμάρυνθος", "Αμαλιάδα", "Αμπελάκια Σαλαμίνας", "Αμπελώνας", "Αμυγδαλεώνας", 
   "Αμφίκλεια", "Αμφιλοχία", "Αμύνταιο	", "Ανάβυσσος", "Ανατολή", "Ανατολικό Θεσσαλονίκης", "Ανδραβίδα", "Ανθούσα Αττικής", "Αντιμάχεια", "Ανώγεια", "Αξιούπολη",
    "Αράχωβα", "Αργοστόλι", "Αριδαία", "Αρκαλοχώρι", "Αρναία", "Αρχάγγελος", "Αρχάνες", "Ασβεστοχώρι", "Ασπροβάλτα", "Αστακός Αιτωλοακαρνανίας", "Αταλάντη", 
    "Αυλώνας", "Αφάντου", "Βάγια Βοιωτίας", "Βάρδα", "Βάρη", "Βέλο Κορινθίας", "Βέροια", "Βαθύ Εύβοιας", "Βαθύλακκος Θεσσαλονίκης", "Βαμβακόπουλο Χανίων", 
    "Βαρθολομιό", "Βασιλικά Θεσσαλονίκης", "Βασιλικό", "Βελβεντός", "Βελεστίνο", "Βιολί Χαράκι Ρεθύμνης", "Βλαχιώτης Λακωνίας", "Βουλιαγμένη", "Βραχάτι", 
    "Βραχναίικα", "Βροντάδος", "Βόλος", "Βόνιτσα", "Γάζι", "Γέρακας", "Γέφυρα Θεσσαλονίκης", "Γαλάτιστα", "Γαλαξείδι Φωκίδας", "Γαλατάς Τροιζηνίας", "Γαλατάς Χανίων", 
    "Γαργαλιάνοι", "Γαστούνη", "Γιάννουλη", "Γιαννιτσά", "Γλυκά Νερά", "Γουμένισσα", "Γρεβενά", "Γυμνό Ευβοίας", "Γύθειο", "Δαράτσος Χανίων", "Δεμένικα", "Δεσκάτη", "Διαβατά", 
    "Διακοπτό", "Διδυμότειχο", "Διμήνι Μαγνησίας", "Διόνυσος", "Διώνη Αττικής", "Δοξάτο", "Δράμα", "Δροσιά", "Δροσιά", "Δρυμός Θεσσαλονίκης", "Ελάτεια", "Ελασσόνα", "Ελεούσα Ιωαννίνων", 
    "Ελευθερούπολη", "Ελευσίνα", "Εξοχή Ιωαννίνων", "Επανομή", "Ερέτρια", "Ερμιόνη Αργολίδας", "Ερμούπολη", "Ερυθρές Αττικής", "Ευξεινούπολη", "Εχίνος", "Ζάκυνθος", "Ζαγκλιβέρι", 
    "Ζαγορά Μαγνησίας", "Ζαρός", "Ζαχάρω", "Ζευγολατειό Κορινθίας", "Ζεφύρι", "Ζηπάρι Κω", "Ηγουμενίτσα", "Ηράκλεια Σερρών", "Ηράκλειο", "Θέρμη", "Θήβα", "Θεσσαλονίκη", "Θρακομακεδόνες",
    "Ιαλυσός", "Ιεράπετρα", "Ιερισσός", "Ιστιαία", "Ιτέα Φωκίδας", "Ιωάννινα", "Κάλυμνος", "Κάρυστος", "Κάτω Αχαΐα", "Κάτω Γούβες Ηρακλείου", "Κάτω Νευροκόπι", "Κάτω Σούλι Αττικής",
    "Κένταυρος Ξάνθης", "Κέρκυρα", "Κέφαλος Κω", "Κίσσαμος", "Κίτσι", "Καβάλα", "Καινούργιο Αιτ/νίας", "Καλαμάτα", "Καλαμπάκα", "Καλαμπάκι", "Καλλιθέα Πιερίας", "Καλοχώρι Θεσσαλονίκης",
    "Καλυθιές Ρόδου", "Καλύβια Θορικού", "Καμένα Βούρλα", "Κανάλια Κέρκυρας", "Καναλλάκι Πρέβεζας", "Καπανδρίτι", "Καρίτσα Πιερίας", "Καρδία Θεσσαλονίκης", "Καρδίτσα", "Καρδαμίτσια Ιωαννίνων", 
    "Καρδιτσομαγούλα", "Καρπενήσι", "Κασσάνδρεια", "Καστοριά", "Κατερίνη", "Κατοχή Αιτωλοακαρνανίας", "Κατσικάς", "Κερατέα", "Κιάτο", "Κιλκίς", "Κιμμέρια", "Κοζάνη", "Κολινδρός", "Κομοτηνή",
    "Κορινός", "Κορωπί", "Κοσκινού Ρόδου", "Κουνουπιδιανά", "Κουφάλια", "Κρανέα Ελασσόνος", "Κρανίδι", "Κρεμαστή", "Κρηνίδες", "Κρουσώνας Ηρακλείου", "Κρυονέρι", "Κρόκος Κοζάνης", 
    "Κρύα", "Κυπαρισσία", "Κυριάκι Βοιωτίας", "Κυψέλη Αίγινας", "Κως", "Κωστακιοί", "Κόνιτσα", "Κόρινθος", "Κύμη", "Κύμινα", "Λάρισα", "Λέχαιο", "Λαγκαδάς", "Λαγυνά", "Λακκί Λέρου",
    "Λαμία", "Λαύριο", "Λεοντάρι", "Λεπενού", "Λεπτοκαρυά Πιερίας", "Λευκάδα", "Λευκίμμη", "Λευκώνας Σερρών", "Λεχαινά", "Λεωνίδιο", "Ληξούρι", "Λητή", "Λιβάδι Λάρισας", "Λιβαδειά",
    "Λιβανάτες	", "Λιμένας Θάσου", "Λιμένας Χερσονήσου", "Λιμενάρια Θάσου", "Λιτόχωρο", "Λουτρά Αιδηψού Εύβοιας", "Λουτράκι", "Λυγουριό Αργολίδας", "Μάλια", "Μάνδρα", "Μέγαρα", "Μέτσοβο",
    "Μαγούλα", "Μακρακώμη", "Μακροχώρι", "Μαλεσίνα Φθιώτιδας", "Μανιάκοι", "Μαραθώνας", "Μαρκόπουλο", "Μαρκόπουλο Ωρωπού", "Μεγάλη Παναγία", "Μεγαλόπολη", "Μελίκη", "Μελισσοχώρι Θεσσαλονίκης",
    "Μεσολόγγι", "Μεσοποταμία Καστοριάς", "Μεσσήνη", "Μιντιλόγλι Αχαΐας", "Μοίρες", "Μολάοι", "Μουρνιές", "Μυτιλήνη", "Μύκονος", "Μύρινα", "Νάξος", "Νάουσα", "Νάουσα Πάρου", 
    "Νέα Αγχίαλος", "Νέα Αρτάκη", "Νέα Βρασνά", "Νέα Βύσσα", "Νέα Ζίχνη", "Νέα Κίος Αργολίδας", "Νέα Καλλικράτεια", "Νέα Καρβάλη", "Νέα Λάμψακος Εύβοιας", "Νέα Μάλγαρα", 
    "Νέα Μάκρη", "Νέα Μαγνησία", "Νέα Μανολάδα Ηλείας", "Νέα Μεσημβρία", "Νέα Μηχανιώνα", "Νέα Μουδανιά", "Νέα Πέραμος", "Νέα Πέραμος Καβάλας", "Νέα Παλάτια", "Νέα Ραιδεστός", 
    "Νέα Σελεύκεια", "Νέα Τρίγλια Χαλκιδικής", "Νέο Καρλόβασι", "Νέο Ρύσιο", "Νέο Σούλι Σερρών", "Νέοι Επιβάτες", "Νέος Μαρμαράς", "Νίκαια Λάρισας", "Ναύπακτος", "Ναύπλιο", 
    "Νεάπολη Κοζάνης", "Νεάπολη Λακωνίας", "Νεάπολη Λασιθίου", "Νεμέα", "Νεοχώρι Αιτωλοακαρνανίας", "Νεροκούρος", "Νιγρίτα", "Νικήσιανη", "Νικήτη", "Ντράφι", "Ξάνθη", "Ξηροπόταμος Δράμας",
    "Ξυλόκαστρο", "Οβρυά", "Οινόφυτα Βοιωτίας", "Οιχαλία Τρικάλων", "Ορεστιάδα", "Ορμύλια", "Ορχομενός", "Πάλαιρος", "Πάνορμος Καλύμνου", "Πάργα", "Πάτρα", "Πέλλα", "Παιανία", 
    "Παλαιά Φώκαια", "Παλαμάς", "Παληό Καβάλας", "Παλλήνη", "Παναιτώλιο", "Παραδείσι", "Παραλία Αχαΐας", "Παραλία Βαθέος Αυλίδος", "Παραμυθιά Θεσπρωτίας", "Παροικιά", "Παστίδα Ρόδου", 
    "Πεδινή Ιωαννίνων", "Πεντάλοφος Θεσσαλονίκης", "Πεντέλη Αττικής", "Περίσταση Πιερίας", "Περαία", "Περιβόλια Κυδωνίας Χανίων", "Πηγάδια Καρπάθου", "Πικέρμι", "Πλάκα Δήλεσι Βοιωτίας", 
    "Πλαγιάρι", "Πλαταμώνας Πιερίας", "Πλατύ Ημαθίας", "Πλωμάρι", "Πολίχνιτος Λέσβου", "Πολύγυρος", "Πολύκαστρο", "Ποταμός Κέρκυρας", "Πρέβεζα", "Προσοτσάνη", "Πτολεμαΐδα", "Πυλί Κω", 
    "Πόρος ", "Πόρτο Ράφτη", "Πύλος", "Πύργος", "Ρέθυμνο", "Ρίο", "Ραφήνα", "Ροδίτσα Φθιώτιδας", "Ροδοδάφνη Αχαΐας", "Ροδολίβος", "Ροδόπολη Αττικής", "Ρόδος", "Σάμος", "Σάπες", "Σέλερο", 
    "Σέρβια", "Σέρρες", "Σήμαντρα Χαλκιδικής", "Σίνδος", "Σαλαμίνα", "Σαρωνίδα Αττικής", "Σελήνια Σαλαμίνας", "Σητεία", "Σιάτιστα", "Σιδηρόκαστρο", "Σκάλα Λακωνίας", "Σκιάθος",
    "Σκούταρι Σερρών", "Σκόπελος", "Σκύδρα", "Σουφλί", "Σοφάδες", "Σοχός", "Σούδα", "Σπάρτη", "Σπάτα", "Σπέτσες", "Σπερχειάδα	", "Σταμάτα", "Σταυρός Θεσσαλονίκης",
    "Σταυρός Φθιώτιδας", "Στυλίδα", "Συκούριο Λάρισας", "Σχηματάρι", "Σύμη", "Τήνος", "Ταγαράδες", "Τερπνή", "Τρίκαλα", "Τρίλοφος", "Τρίπολη", "Τραγανό Πηνειού Ηλείας",
    "Τσαριτσάνη", "Τυμπάκι", "Τυχερό Έβρου", "Τύρναβος", "Φάρσαλα", "Φέρες", "Φίλυρο", "Φαλάννη Λάρισας", "Φαρκαδόνα", "Φιλιάτες", "Φιλιατρά", "Φιλιππιάδα", "Φλώρινα",
    "Φυλή", "Χίος", "Χαλάστρα", "Χαλκίδα", "Χαλκηδόνα Θεσσαλονίκης", "Χαλκούτσι", "Χανιά", "Χλόη Καστοριάς", "Χορτιάτης", "Χρυσούπολη", "Χωριστή", "Χώρα Μεσσηνίας", "Ψαχνά", "Ωραιόκαστρο"];


   //oi idioi 3 pinakes alla xwris tonous gia na kanei autocomplete kai otan o xristis grafei xwris tonous (idika apo kinito)
     
    var dogRacesNoTone  = ["Ημιαιμο","αγ.Βερναρδου", "αγγλικο Μπουλντογκ", "αγγλικο Σετερ", "αγγλικος Ποιμενικος", "ακιτα", "Aριεγης", "αρτουα", "αφγανικο Λαγωνικο", "Βελγικο Ποιμενικο", 
    "Βαϊμαρανερ ", "Βιζλα", "Γαλλικο Μπουλντογκ", "Γερμανικος Ποιμενικος ", "Γιορκσαιρ Τεριε ", "Γιουρα Μπρουνο", "Γκρει Χαουντ", "Γκριφον", "Γκολντεν Ριτριβερ", 
    "Γουεστ Χαιλαντ", "Γουιπετ", "Δαλματιας", "Ελληνικος Ιχνηλατης", "Ελληνικος Ποιμενικος", "επανιελ Μπρετον", "Θιβετιανο Μαστιφ", "Κανγκαλ", "Κανε Κορσο", "Κανις",
    "Καναδεζικο Λυκοσκυλο", "Κινγκ Τσαρλς", "Κοκονι", "Κουρτσχααρ", "Κρητικος Λαγωνικος", "Κοκερ Σπανιελ", "Κολεϊ ", "Κοργκι", "Λασα απσο", "Λαμπραντορ Ριτριβερ",
    "Λευκο Ελληνικο Τσοπανοσκυλο", "Μαλαμουτ", "Μαλινουα", "Μαλτεζ", "Μαστινο Ναπολιτανο", "Μεγαλος Δανος", "Μολοσσος της Ηπειρου", "Mπαλκαν", "Μπαντογκ",
    "Μπασε Χαουντ", "Μπηγκλ", "Μπισον Φριζε", "Μπλαντ Χαουντ", "Μπλε γασκωνης", "Μπουλ Μαστιφ", "Μπουλ Ντογκ", "Μπουλ Τερριε", "Μποξερ", "Μπορντερ Κολεϋ",
    "Νεας Γης", "Ντατσχαουντ - Λουκανικο", "Ντογκ ντε Μπορντω", "Ντρατχααρ", "Ντογκο αρτζεντινο", "Ντομπερμαν", "Ολλανδικο Ποιμενικο", "Ορεινος Πυρηναιων",
    "Ορεινος σκυλος Βερνης", "Πινσερ", "Πιτ Μπουλ Τερριε", "Παγκ", "Παπιγιον", "Πεκινουα", "Ποιμενικος Καυκασου", "Ποιμενικος Κεντρ. ασιας", "Πομερανιαν",
    "Πρεσα Καναριο", "Ποιντερ", "Ροτβαιλερ", "Σιμπα ινου", "Σαμογιεντ", "Σαρ Πει", "Σεγκουτσι", "Σιβηρικο Χασκυ", "Σιχ Τσου", "Σναουτσερ", "Σπιτζ ",
    "Σπρινγκερ Σπανιελ", "Τεριε", "Τεριε Βοστονης", "Τζακ Ρασελ Τεριε", "Τσιουαουα", "Τσοου Τσοου ", "Φοξ Τερριε"];


    var catRacesNoTone  = ["Ημιαιμο","αβυσσυνιας", "αγκυρας", "αιγυπτιακη Μαου", "αμερικανικη Κοντοτριχη", "Βεγγαλης", "Βιρμανιας",
    "Βρετανικη Κοντοτριχη", "Βρετανικη Μακρυτριχη", "Γατα αιγαιου", "Γατα Βομβαης", "Γατα Νορβηγικου Δασους",
    "Γατα Σαβαννας", "Γατα του Σιαμ", "Εξωτικη", "Εξωτικη Κοντοτριχη", "Ιμαλαΐων", "Μειν Κουν", "Μανξ", "Μπαλινεζα",
    "Οριενταλ Κοντοτριχη", "Περσικη", "Ραγκ Ντολ", "Ρωσικη μπλε γατα", "Ρωσσικη", "Σιαμαιζα", "Σιβηριας", "Σιγκαπουρης",
    "Σφιγγα", "American Curl", "Kurilian Bobtail", "Munchkin", "Oriental", "Turkvan Cat"];
	
	
    var citiesNoTone = ["αγιοι Θεοδωροι Κορινθιας", "αγιος αθανασιος Δραμας", "αγιος αθανασιος Θεσ/νικης", "αγιος Βασιλειος αχαΐας", "αγιος Κηρυκος Ικαριας", 
   "αγιος Κωνσταντινος Φθιωτιδας", "αγιος Νικολαος", "αγιος Νικολαος Ληλαντιων", "αγιος Στεφανος", "αδενδρο", "αμφισσα", "ανοιξη", "αργος", 
   "αργος Ορεστικο", "αρια αργολιδας", "αρτα", "αρτεμη", "αστρος", "εδεσσα", "ιασμος Ροδοπης", "αιγινα", "αιγιο", "αγια Βαρβαρα Ηρακλειου", 
   "αγια Μαρινα Κορωπιου", "αγια Μαρινα Λερου", "αγια Μαρινα Χανιων", "αγια Παρασκευη Θεσ/νικης", "αγια Παρασκευη Λεσβου", "αγια Τριαδα Θεσσαλονικης", 
   "αγια Λαρισας", "αγιασος	", "αγρινιο", "αγρια", "αθηνα", "αιαντειο Σαλαμινας", "αιανη Κοζανης", "αιγινιο", "αιτωλικο", "αλιαρτος", "αλεξανδρεια", 
   "αλεξανδρουπολη", "αλεπου Κερκυρας", "αλιβερι", "αλιστρατη", "αλμυρος", "αμαρυνθος", "αμαλιαδα", "αμπελακια Σαλαμινας", "αμπελωνας", "αμυγδαλεωνας", 
   "αμφικλεια", "αμφιλοχια", "αμυνταιο	", "αναβυσσος", "ανατολη", "ανατολικο Θεσσαλονικης", "ανδραβιδα", "ανθουσα αττικης", "αντιμαχεια", "ανωγεια", "αξιουπολη",
    "αραχωβα", "αργοστολι", "αριδαια", "αρκαλοχωρι", "αρναια", "αρχαγγελος", "αρχανες", "ασβεστοχωρι", "ασπροβαλτα", "αστακος αιτωλοακαρνανιας", "αταλαντη", 
    "αυλωνας", "αφαντου", "Βαγια Βοιωτιας", "Βαρδα", "Βαρη", "Βελο Κορινθιας", "Βεροια", "Βαθυ Ευβοιας", "Βαθυλακκος Θεσσαλονικης", "Βαμβακοπουλο Χανιων", 
    "Βαρθολομιο", "Βασιλικα Θεσσαλονικης", "Βασιλικο", "Βελβεντος", "Βελεστινο", "Βιολι Χαρακι Ρεθυμνης", "Βλαχιωτης Λακωνιας", "Βουλιαγμενη", "Βραχατι", 
    "Βραχναιικα", "Βρονταδος", "Βολος", "Βονιτσα", "Γαζι", "Γερακας", "Γεφυρα Θεσσαλονικης", "Γαλατιστα", "Γαλαξειδι Φωκιδας", "Γαλατας Τροιζηνιας", "Γαλατας Χανιων", 
    "Γαργαλιανοι", "Γαστουνη", "Γιαννουλη", "Γιαννιτσα", "Γλυκα Νερα", "Γουμενισσα", "Γρεβενα", "Γυμνο Ευβοιας", "Γυθειο", "Δαρατσος Χανιων", "Δεμενικα", "Δεσκατη", "Διαβατα", 
    "Διακοπτο", "Διδυμοτειχο", "Διμηνι Μαγνησιας", "Διονυσος", "Διωνη αττικης", "Δοξατο", "Δραμα", "Δροσια", "Δροσια", "Δρυμος Θεσσαλονικης", "Ελατεια", "Ελασσονα", "Ελεουσα Ιωαννινων", 
    "Ελευθερουπολη", "Ελευσινα", "Εξοχη Ιωαννινων", "Επανομη", "Ερετρια", "Ερμιονη αργολιδας", "Ερμουπολη", "Ερυθρες αττικης", "Ευξεινουπολη", "Εχινος", "Ζακυνθος", "Ζαγκλιβερι", 
    "Ζαγορα Μαγνησιας", "Ζαρος", "Ζαχαρω", "Ζευγολατειο Κορινθιας", "Ζεφυρι", "Ζηπαρι Κω", "Ηγουμενιτσα", "Ηρακλεια Σερρων", "Ηρακλειο", "Θερμη", "Θηβα", "Θεσσαλονικη", "Θρακομακεδονες",
    "Ιαλυσος", "Ιεραπετρα", "Ιερισσος", "Ιστιαια", "Ιτεα Φωκιδας", "Ιωαννινα", "Καλυμνος", "Καρυστος", "Κατω αχαΐα", "Κατω Γουβες Ηρακλειου", "Κατω Νευροκοπι", "Κατω Σουλι αττικης",
    "Κενταυρος Ξανθης", "Κερκυρα", "Κεφαλος Κω", "Κισσαμος", "Κιτσι", "Καβαλα", "Καινουργιο αιτ/νιας", "Καλαματα", "Καλαμπακα", "Καλαμπακι", "Καλλιθεα Πιεριας", "Καλοχωρι Θεσσαλονικης",
    "Καλυθιες Ροδου", "Καλυβια Θορικου", "Καμενα Βουρλα", "Καναλια Κερκυρας", "Καναλλακι Πρεβεζας", "Καπανδριτι", "Καριτσα Πιεριας", "Καρδια Θεσσαλονικης", "Καρδιτσα", "Καρδαμιτσια Ιωαννινων", 
    "Καρδιτσομαγουλα", "Καρπενησι", "Κασσανδρεια", "Καστορια", "Κατερινη", "Κατοχη αιτωλοακαρνανιας", "Κατσικας", "Κερατεα", "Κιατο", "Κιλκις", "Κιμμερια", "Κοζανη", "Κολινδρος", "Κομοτηνη",
    "Κορινος", "Κορωπι", "Κοσκινου Ροδου", "Κουνουπιδιανα", "Κουφαλια", "Κρανεα Ελασσονος", "Κρανιδι", "Κρεμαστη", "Κρηνιδες", "Κρουσωνας Ηρακλειου", "Κρυονερι", "Κροκος Κοζανης", 
    "Κρυα", "Κυπαρισσια", "Κυριακι Βοιωτιας", "Κυψελη αιγινας", "Κως", "Κωστακιοι", "Κονιτσα", "Κορινθος", "Κυμη", "Κυμινα", "Λαρισα", "Λεχαιο", "Λαγκαδας", "Λαγυνα", "Λακκι Λερου",
    "Λαμια", "Λαυριο", "Λεονταρι", "Λεπενου", "Λεπτοκαρυα Πιεριας", "Λευκαδα", "Λευκιμμη", "Λευκωνας Σερρων", "Λεχαινα", "Λεωνιδιο", "Ληξουρι", "Λητη", "Λιβαδι Λαρισας", "Λιβαδεια",
    "Λιβανατες	", "Λιμενας Θασου", "Λιμενας Χερσονησου", "Λιμεναρια Θασου", "Λιτοχωρο", "Λουτρα αιδηψου Ευβοιας", "Λουτρακι", "Λυγουριο αργολιδας", "Μαλια", "Μανδρα", "Μεγαρα", "Μετσοβο",
    "Μαγουλα", "Μακρακωμη", "Μακροχωρι", "Μαλεσινα Φθιωτιδας", "Μανιακοι", "Μαραθωνας", "Μαρκοπουλο", "Μαρκοπουλο Ωρωπου", "Μεγαλη Παναγια", "Μεγαλοπολη", "Μελικη", "Μελισσοχωρι Θεσσαλονικης",
    "Μεσολογγι", "Μεσοποταμια Καστοριας", "Μεσσηνη", "Μιντιλογλι αχαΐας", "Μοιρες", "Μολαοι", "Μουρνιες", "Μυτιληνη", "Μυκονος", "Μυρινα", "Ναξος", "Ναουσα", "Ναουσα Παρου", 
    "Νεα αγχιαλος", "Νεα αρτακη", "Νεα Βρασνα", "Νεα Βυσσα", "Νεα Ζιχνη", "Νεα Κιος αργολιδας", "Νεα Καλλικρατεια", "Νεα Καρβαλη", "Νεα Λαμψακος Ευβοιας", "Νεα Μαλγαρα", 
    "Νεα Μακρη", "Νεα Μαγνησια", "Νεα Μανολαδα Ηλειας", "Νεα Μεσημβρια", "Νεα Μηχανιωνα", "Νεα Μουδανια", "Νεα Περαμος", "Νεα Περαμος Καβαλας", "Νεα Παλατια", "Νεα Ραιδεστος", 
    "Νεα Σελευκεια", "Νεα Τριγλια Χαλκιδικης", "Νεο Καρλοβασι", "Νεο Ρυσιο", "Νεο Σουλι Σερρων", "Νεοι Επιβατες", "Νεος Μαρμαρας", "Νικαια Λαρισας", "Ναυπακτος", "Ναυπλιο", 
    "Νεαπολη Κοζανης", "Νεαπολη Λακωνιας", "Νεαπολη Λασιθιου", "Νεμεα", "Νεοχωρι αιτωλοακαρνανιας", "Νεροκουρος", "Νιγριτα", "Νικησιανη", "Νικητη", "Ντραφι", "Ξανθη", "Ξηροποταμος Δραμας",
    "Ξυλοκαστρο", "Οβρυα", "Οινοφυτα Βοιωτιας", "Οιχαλια Τρικαλων", "Ορεστιαδα", "Ορμυλια", "Ορχομενος", "Παλαιρος", "Πανορμος Καλυμνου", "Παργα", "Πατρα", "Πελλα", "Παιανια", 
    "Παλαια Φωκαια", "Παλαμας", "Παληο Καβαλας", "Παλληνη", "Παναιτωλιο", "Παραδεισι", "Παραλια αχαΐας", "Παραλια Βαθεος αυλιδος", "Παραμυθια Θεσπρωτιας", "Παροικια", "Παστιδα Ροδου", 
    "Πεδινη Ιωαννινων", "Πενταλοφος Θεσσαλονικης", "Πεντελη αττικης", "Περισταση Πιεριας", "Περαια", "Περιβολια Κυδωνιας Χανιων", "Πηγαδια Καρπαθου", "Πικερμι", "Πλακα Δηλεσι Βοιωτιας", 
    "Πλαγιαρι", "Πλαταμωνας Πιεριας", "Πλατυ Ημαθιας", "Πλωμαρι", "Πολιχνιτος Λεσβου", "Πολυγυρος", "Πολυκαστρο", "Ποταμος Κερκυρας", "Πρεβεζα", "Προσοτσανη", "Πτολεμαΐδα", "Πυλι Κω", 
    "Πορος ", "Πορτο Ραφτη", "Πυλος", "Πυργος", "Ρεθυμνο", "Ριο", "Ραφηνα", "Ροδιτσα Φθιωτιδας", "Ροδοδαφνη αχαΐας", "Ροδολιβος", "Ροδοπολη αττικης", "Ροδος", "Σαμος", "Σαπες", "Σελερο", 
    "Σερβια", "Σερρες", "Σημαντρα Χαλκιδικης", "Σινδος", "Σαλαμινα", "Σαρωνιδα αττικης", "Σεληνια Σαλαμινας", "Σητεια", "Σιατιστα", "Σιδηροκαστρο", "Σκαλα Λακωνιας", "Σκιαθος",
    "Σκουταρι Σερρων", "Σκοπελος", "Σκυδρα", "Σουφλι", "Σοφαδες", "Σοχος", "Σουδα", "Σπαρτη", "Σπατα", "Σπετσες", "Σπερχειαδα	", "Σταματα", "Σταυρος Θεσσαλονικης",
    "Σταυρος Φθιωτιδας", "Στυλιδα", "Συκουριο Λαρισας", "Σχηματαρι", "Συμη", "Τηνος", "Ταγαραδες", "Τερπνη", "Τρικαλα", "Τριλοφος", "Τριπολη", "Τραγανο Πηνειου Ηλειας",
    "Τσαριτσανη", "Τυμπακι", "Τυχερο εβρου", "Τυρναβος", "Φαρσαλα", "Φερες", "Φιλυρο", "Φαλαννη Λαρισας", "Φαρκαδονα", "Φιλιατες", "Φιλιατρα", "Φιλιππιαδα", "Φλωρινα",
    "Φυλη", "Χιος", "Χαλαστρα", "Χαλκιδα", "Χαλκηδονα Θεσσαλονικης", "Χαλκουτσι", "Χανια", "Χλοη Καστοριας", "Χορτιατης", "Χρυσουπολη", "Χωριστη", "Χωρα Μεσσηνιας", "Ψαχνα", "Ωραιοκαστρο"];

















    var cityAlreadyFilled = false;
    var raceAlreadyFilled = false;


   //arxikopoiei tis listes(divs) sth selida
    function initList() {
        
         clearList(document.querySelector("#cityLista"));
         clearList(document.querySelector("#raceLista"));

         populateList(document.querySelector("#cityLista"),cities);
         populateList(document.querySelector("#raceLista"),dogRaces);
    }

    //adeiazei thn lista(div)
    function clearList(node) {
        while (node.hasChildNodes()) {
        node.removeChild(node.firstChild);
        }
    }

    //gemizei thn lista(div) me times apo kapoion pinaka
    function populateList(myList,myArray){
      for (var i = 0; i < myArray.length; i++) {
          createDiv(myArray[i],(myList)); 
      } 
    }

    //dimiourgei div kai to kanei append se ena allo div (pou leitourgei ws lista)
    function createDiv(myitem,mylist){
        var child = document.createElement('div');
        child.textContent = myitem ;
        child.classList.add('loaded');
        mylist.appendChild(child);  
    }


      //input events panw sthn forma / kallei thn  autoComplete gia to katallilo input (polh/ratses)   htan searchForm
    document.querySelector("#mymain").addEventListener('input',function(e){
        if(e.target.id =="city"){
            autoComplete(document.querySelector("#cityLista"),cityAlreadyFilled,cities,event.target.value,citiesNoTone);
        }
        else if(e.target.id =="race"){
            if(document.querySelector('#type').value =="Σκύλος"){
                var myArray = dogRaces;
                var myArray2 = dogRacesNoTone;
            }
            else{
                var myArray = catRaces;
                var myArray2 = catRacesNoTone;
            }
            autoComplete(document.querySelector("#raceLista"),raceAlreadyFilled,myArray,event.target.value,myArray2);
        }
    });

       // autocomple function anoigei lista meta kalei thn match pou thn gemizei analoga me auto pou eisagei o xristis
    function autoComplete(node,filled,myArray,value,myArray2){
           node.classList.add('open');
           filled=false;
           match(node,myArray,value,myArray2);
    }


         //click events panw sthn type select (gia allagh anamesa se ratses skulwn kai gatwn)   
    document.querySelector("#mymain").addEventListener('change',function(e){
        if(e.target.id == "type"){
        clearList(document.querySelector("#raceLista"));
        document.querySelector('#race').value="";
        if(e.target.value == "Σκύλος"){
           populateList(document.querySelector("#raceLista"),dogRaces);
        }
        else{
           populateList(document.querySelector("#raceLista"),catRaces);
        }

       }

    }); 

 

      //event listener gia click events panw sthn main pou aforoun thn autocomplete
    document.querySelector("#mymain").addEventListener('click',function(e){
      
        //arxikopoish ths listas prepei na ginete elegxos se kathe click etc logou ths allaghs main me Ajax
      if(document.querySelector('#cityLista') !== null && document.querySelector('#city').value==""){
        if(document.querySelector('#cityLista').childElementCount==0 && document.querySelector('#raceLista').childElementCount==0 ){
                initList();
        }
      }
        
        //anoigma ths listas me click panw sto input
            if(e.target.id =="city"){
                if (!cityAlreadyFilled) {
                    document.querySelector('#cityLista').classList.add('open');   
                }
            }
            else if(e.target.id=="race"){
                if (!raceAlreadyFilled ) {
                    document.querySelector('#raceLista').classList.add('open');   
                }
            }  
       
  

          //epilogh kai gemisma tou input
     if(e.target && e.target.classList.contains('loaded')){        
        if(e.target.parentNode.id =="cityLista"){
            fillInput(document.querySelector("#city"),cityAlreadyFilled,e.target.textContent);
        }

        if(e.target.parentNode.id =="raceLista"){
            fillInput(document.querySelector("#race"),raceAlreadyFilled,e.target.textContent);   
        }

      }
      
         
     });

     //gemizei to katalilo input me epilegmenh timh
      function fillInput(node,filled,value){
          node.value=value;
          filled=true;
      } 


    document.addEventListener('click',function(e){
       //kleisimo ths listas (me css)
    if(document.querySelector("#cityLista")!== null){
        if (!(e.target.classList.contains('autoInput'))) {
       
        document.querySelector("#cityLista").classList.remove('open');
        document.querySelector("#raceLista").classList.remove('open');
       }
       else{
           if(e.target.id == "race" ){
                document.querySelector("#cityLista").classList.remove('open');
           }
           else{
                document.querySelector("#raceLista").classList.remove('open');
           }
       }
    }
    });

//kanei to tairiazmo tou input tou xristi me tis times se pinaka
function match(node,myArray,str,myArray2) {
    str = str.toLowerCase();
    clearList(node);
    for (var i = 0; i < myArray.length; i++) {
        if (myArray[i].toLowerCase().startsWith(str) || myArray2[i].toLowerCase().startsWith(str)) {
            createDiv(myArray[i],node); 
        }
    }
}

});

